Revit 2027 API
ReferencePlane.BubbleEnd Property
 The bubble end of the reference plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ BubbleEnd { get; set; }
Public Property BubbleEnd As XYZ
	Get
	Set
public:
property XYZ^ BubbleEnd {
	XYZ^ get ();
	void set (XYZ^ value);
}
member BubbleEnd : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 When setting this property, an exception will be thrown if the bubble end is set to almost the same point as free end or if the vector from BubbleEnd -> FreeEnd is not perpendicular to the normal vector.
See Also
Reference
ReferencePlane Class
Autodesk.Revit.DB Namespace